import logging

# ==================== НАСТРОЙКИ БОТА ====================
TOKEN = "8636454027:AAFF78YrR5X9-zX28kB0_03-SzeP7hyMOao"
MECHANIC_ID = 7531722076
LOGIST_IDS = [8504590692,1093924638,778518585]          # можно добавить ещё через запятую

MACHINES = [
    "A664AX977", "A692AX977", "A707AX977", "A723AX977", "A726AX977",
    "A735AX977", "A755AX977", "A775AX977", "A859AX977", "B027AX977",
    "B028AX977", "E196EA977", "E597EA977", "E611EA977", "E635EA977",
    "E800EA977", "E955EA977", "E976EA977", "H472EA977", "H564EA977",
    "H712EA977", "H773EA977", "H793EA977", "H805EA977", "B965AX977",
    "A341KO977", "A375AX977", "A683AX977", "A696AX977", "A887AX977",
    "A916AX977", "B015AX977", "B904AX977", "E065EA977", "E088EA977",
    "E112EA977", "E138EA977", "E171EA977", "E438EA977", "E588EA977",
    "E598EA977", "E600EA977", "E615EA977", "E670EA977", "E697EA977",
    "E892EA977", "E926EA977", "H587EA977", "H730EA977", "H781EA977",
    "Другая машина",
]
# =======================================================

logging.basicConfig(level=logging.INFO)
logger = logging.getLogger(__name__)
